{
    "cards": [
    {
    "id": 1,
	"term": "abstract",
	"definition": "A Java keyword used in a class definition to specify that a class is not to be instantiated, but rather inherited by other classes. An abstract class can have abstract methods that are not implemented in the abstract class, but in subclasses."
	},
{   "id": 2,
	"term": "abstract class",
	"definition": "A class that contains one or more abstract methods , and therefore can never be instantiated. Abstract classes are defined so that other classes can extend them and make them concrete by implementing the abstract methods."
	},
{   "id": 3,
	"term": "abstract method",
	"definition": "A method that has no implementation."
	},
{   "id": 4,
	"term": "Abstract Window Toolkit (AWT)",
	"definition": "A collection of graphical user interface (GUI) components that were implemented using native-platform versions of the components. These components provide that subset of functionality which is common to all native platforms. Largely supplanted by the Project Swing component set. See also Swing ."
	},
{   "id": 5,
	"term": "access control",
	"definition": "The methods by which interactions with resources are limited to collections of users or programs for the purpose of enforcing integrity, confidentiality, or availability constraints."
	},
{   "id": 6,
	"term": "ACID",
	"definition": "The acronym for the four properties guaranteed by transactions: atomicity, consistency, isolation, and durability."
	},
{   "id": 7, 
	"term": "actual parameter list",
	"definition": "The arguments specified in a particular method call. See also formal parameter list ."
	},
{   "id": 8,
	"term": "API",
	"definition": "Application Programming Interface. The specification of how a programmer writing an application accesses the behavior and state of classes and objects."
	},
{   "id": 9, 
	"term": "applet",
	"definition": "A component that typically executes in a Web browser, but can execute in a variety of other applications or devices that support the applet programming model."
	},
{   "id": 10,
	"term": "argument",
	"definition": "A data item specified in a method call. An argument can be a literal value, a variable, or an expression."
	},
{   "id": 11,
	"term": "array",
	"definition": "A collection of data items, all of the same type, in which each item's position is uniquely designated by an integer."
	},
{   "id": 12,
	"term": "ASCII",
	"definition": "American Standard Code for Information Interchange. A standard assignment of 7-bit numeric codes to characters. See also Unicode ."
	},
{   "id": 13,
	"term": "atomic",
	"definition": "Refers to an operation that is never interrupted or left in an incomplete state under any circumstance."
	},
{   "id": 14,
	"term": "authentication",
	"definition": "The process by which an entity proves to another entity that it is acting on behalf of a specific identity."
	},
{   "id": 15,
	"term": "authorization",
	"definition": "See access control."
	},
{   "id": 16,
	"term": "autoboxing",
	"definition": "Automatic conversion between reference and primitive types."
},
{   "id": 17,
	"term": "bean",
	"definition": "A reusable software component that conforms to certain design and naming conventions. The conventions enable beans to be easily combined to create an application using tools that understand the conventions."
	},
{   "id": 18,
	"term": "binary operator",
	"definition": "An operator that has two arguments."
	},
{   "id": 19,
	"term": "bit",
	"definition": "The smallest unit of information in a computer, with a value of either 0 or 1."
	},
{   "id": 20,
	"term": "bitwise operator",
	"definition": "An operator that manipulates the bits of one or more of its operands individually and in parallel. Examples include the binary logical operators (&, |, ^), the binary shift operators (<<, >>, >>>) and the unary one's complement operator (~)."
	},
{   "id": 21,
	"term": "block",
	"definition": "In the Java programming language, any code between matching braces. Example: { x = 1; }."
	},
{   "id": 22,
	"term": "boolean",
	"definition": "Refers to an expression or variable that can have only a true or false value. The Java programming language provides the boolean type and the literal values true and false."
	},
{   "id": 23,
	"term": "break",
	"definition": "A Java keyword used to resume program execution at the statement immediately following the current statement. If followed by a label, the program resumes execution at the labeled statement."
	},
{   "id": 24,
	"term": "byte",
	"definition": "A sequence of eight bits. Java provides a corresponding byte type."
	},
{   "id": 25,
	"term": "bytecode",
	"definition": "Machine-independent code generated by the Java compiler and executed by the Java interpreter."
	},
{   "id": 26,
	"term": "case",
	"definition": "A Java keyword that defines a group of statements to begin executing if a value specified matches the value defined by a preceding switch keyword."
	},
{   "id": 27,
	"term": "casting",
	"definition": "Explicit conversion from one data type to another."
	},
{   "id": 28,
	"term": "catch",
	"definition": "A Java keyword used to declare a block of statements to be executed in the event that a Java exception, or run time error, occurs in a preceding try block."
	},
{   "id": 29, 
	"term": "char",
	"definition": "A Java keyword used to declare a variable of type character."
	},
{   "id": 30,
	"term": "class",
	"definition": "In the Java programming language, a type that defines the implementation of a particular kind of object. A class definition defines instance and class variables and methods, as well as specifying the interfaces the class implements and the immediate superclass of the class. If the superclass is not explicitly specified, the superclass will implicitly be Object."
	},
{   "id": 31,
	"term": "class method",
	"definition": "A method that is invoked without reference to a particular object. Class methods affect the class as a whole, not a particular instance of the class. Also called a static method . See also instance method ."
	},
{   "id": 32, 
	"term": "class variable",
	"definition": "A data item associated with a particular class as a whole--not with particular instances of the class. Class variables are defined in class definitions. Also called a static field . See also instance variable ."
	},
{   "id": 33, 
	"term": "classpath",
	"definition": "An environmental variable which tells the Java virtual machine 1 and Java technology-based applications where to find the class libraries, including user-defined class libraries."
	},
{   "id": 34, 
	"term": "client",
	"definition": "In the client/server model of communications, the client is a process that remotely accesses resources of a compute server, such as compute power and large memory capacity."
	},
{   "id": 35, 
	"term": "codebase",
	"definition": "Works together with the code attribute in the <APPLET> tag to give a complete specification of where to find the main applet class file: code specifies the name of the file, and codebase specifies the URL of the directory containing the file."
	},
{   "id": 36, 
	"term": "comment",
	"definition": "In a program, explanatory text that is ignored by the compiler. In programs written in the Java programming language, comments are delimited using // or /*... */."
	},
{   "id": 37, 
	"term": "commit",
	"definition": "The point in a transaction when all updates to any resources involved in the transaction are made permanent.                         "
	},
{   "id":38, 
	"term": "compilation unit",
	"definition": "The smallest unit of source code that can be compiled. In the current implementation of the Java platform, the compilation unit is a file."
	},
{   "id": 39, 
	"term": "compiler",
	"definition": "A program to translate source code into code to be executed by a computer. The Java compiler translates source code written in the Java programming language into bytecode for the Java virtual machine 1 . See also interpreter ."
	},
{   "id": 40, 
	"term": "compositing",
	"definition": "The process of superimposing one image on another to create a single image."
	},
{   "id": 41, 
	"term": "constructor",
	"definition": "A pseudo-method that creates an object. In the Java programming language, constructors are instance methods with the same name as their class. Constructors are invoked using the new keyword."
	},
{   "id":42, 
	"term": "const",
	"definition": "A reserved Java keyword not used by current versions of the Java programming language."
	},
{   "id": 43, 
	"term": "continue",
	"definition": "A Java keyword used to resume program execution at the end of the current loop. If followed by a label, continue resumes execution where the label occurs."
	},
{   "id": 44, 
	"term": "conversational state",
	"definition": "The field values of a session bean plus the transitive closure of the objects reachable from the bean's fields. The transitive closure of a bean is defined in terms of the serialization protocol for the Java programming language, that is, the fields that would be stored by serializing the bean instance."
	},
{   "id": 45, 
	"term": "CORBA",
	"definition": "Common Object Request Broker Architecture. A language independent, distributed object model specified by the Object Management Group (OMG)."
	},
{   "id": 46, 
	"term": "core class",
	"definition": "A public class (or interface) that is a standard member of the Java Platform. The intent is that the core classes for the Java platform, at minimum, are available on all operating systems where the Java platform runs. A program written entirely in the Java programming language relies only on core classes, meaning it can run anywhere. ."
	},
{   "id": 47, 
	"term": "core packages",
	"definition": "The required set of APIs in a Java platform edition which must be supported in any and all compatible implementations."
	},
{   "id": 48, 
	"term": "credentials",
	"definition": "The information describing the security attributes of a principal. Credentials can be acquired only through authentication or delegation."
	},
{   "id": 49, 
	"term": "critical section",
	"definition": "A segment of code in which a thread uses resources (such as certain instance variables) that can be used by other threads, but that must not be used by them at the same time."
	},
{   "id": 50, 
	"term": "declaration",
	"definition": "A statement that establishes an identifier and associates attributes with it, without necessarily reserving its storage (for data) or providing the implementation (for methods). See also definition."
	},
{   "id": 51, 
	"term": "default",
	"definition": "A Java keyword optionally used after all case conditions in a switch statement. If all case conditions are not matched by the value of the switch variable, the default keyword will be executed."
	},
{   "id": 52, 
	"term": "definition",
	"definition": "A declaration that reserves storage (for data) or provides implementation (for methods). See also declaration."
	},
{   "id": 53, 
	"term": "delegation",
	"definition": "An act whereby one principal authorizes another principal to use its identity or privileges with some restrictions."
	},
{   "id": 54, 
	"term": "deprecation",
	"definition": "Refers to a class, interface, constructor, method or field that is no longer recommended, and may cease to exist in a future version."
	},
{   "id": 55, 
	"term": "derived from",
	"definition": "Class X is \"derived from\" class Y if class X extends class Y. See also subclass , superclass ."
	},
{   "id": 56, 
	"term": "distributed",
	"definition": "Running in more than one address space."
	},
{   "id": 57, 
	"term": "distributed application",
	"definition": "An application made up of distinct components running in separate runtime environments, usually on different platforms connected through a network. Typical distributed applications are two-tier (client/server), three-tier (client/middleware/server), and n-tier (client/multiple middleware/multiple servers)."
	},
{   "id": 58, 
	"term": "do",
	"definition": "A Java keyword used to declare a loop that will iterate a block of statements. The loop's exit condition can be specified with the while keyword."
	},
{   "id": 59, 
	"term": "DOM",
	"definition": "Document Object Model. A tree of objects with interfaces for traversing the tree and writing an XML version of it, as defined by the W3C specification."
	},
{   "id": 60, 
	"term": "double",
	"definition": "A Java keyword used to define a variable of type double."
	},
{   "id": 70, 
	"term": "double precision",
	"definition": "In the Java programming language specification, describes a floating point number that holds 64 bits of data. See also single precision ."
	},
{   "id": 80, 
	"term": "DTD",
	"definition": "Document Type Definition. A description of the structure and properties of a class of XML files."
	},
{   "id": 90, 
	"term": "else",
	"definition": "A Java keyword used to execute a block of statements in the case that the test condition with the if keyword evaluates to false."
	},
{   "id": 91, 
	"term": "EmbeddedJava Technology",
	"definition": "The availability of Java 2 Platform, Micro Edition technology under a restrictive license agreement that allows a licensee to leverage certain Java technologies to create and deploy a closed-box application that exposes no APIs."
	},
{   "id": 92, 
	"term": "encapsulation",
	"definition": "The localization of knowledge within a module. Because objects encapsulate data and implementation, the user of an object can view the object as a black box that provides services. Instance variables and methods can be added, deleted, or changed, but as long as the services provided by the object remain the same, code that uses the object can continue to use it without being rewritten. See also instance variable , instance method. "
	},
{   "id": 93, 
	"term": "enum",
	"definition": "A Java keyword used to declare an enumerated type."
	},
{   "id": 94, 
	"term": "enumerated type",
	"definition": "A type whose legal values consist of a fixed set of constants."
	},
{   "id": 95,
	"term": "exception",
	"definition": "An event during program execution that prevents the program from continuing normally; generally, an error. The Java programming language supports exceptions with the try, catch, and throw keywords. See also exception handler."
	},
{   "id": 96,
	"term": "exception handler",
	"definition": "A block of code that reacts to a specific type of exception. If the exception is for an error that the program can recover from, the program can resume executing after the exception handler has executed."
	},
{   "id": 97,
	"term": "executable content",
	"definition": "An application that runs from within an HTML file. See also applet ."
	},
{   "id": 98,
	"term": "extends",
	"definition": "Class X extends class Y to add functionality, either by adding fields or methods to class Y, or by overriding methods of class Y. An interface extends another interface by adding methods. Class X is said to be a subclass of class Y. See also derived from ."
	},
{   "id": 99,
	"term": "field",
	"definition": "A data member of a class. Unless specified otherwise, a field is not static."
	},
{   "id": 100,
	"term": "final",
	"definition": "A Java keyword. You define an entity once and cannot change it or derive from it later. More specifically: a final class cannot be subclassed, a final method cannot be overridden and a final variable cannot change from its initialized value."
	},
{   "id": 101,
	"term": "finally",
	"definition": "A Java keyword that executes a block of statements regardless of whether a Java Exception, or run time error, occurred in a block defined previously by the try keyword."
	},
{   "id": 102,
	"term": "float",
	"definition": "A Java keyword used to define a floating point number variable."
	},
{   "id": 103,
	"term": "for",
	"definition": "A Java keyword used to declare a loop that reiterates statements. The programmer can specify the statements to be executed, exit conditions, and initialization variables for the loop."
	},
{   "id": 104,
	"term": "FTP",
	"definition": "File Transfer Protocol. FTP, which is based on TCP/IP, enables the fetching and storing of files between hosts on the Internet. See also TCP/IP ."
	},
{   "id": 105,
	"term": "formal parameter list",
	"definition": "The parameters specified in the definition of a particular method. See also actual parameter list ."
	},
{   "id": 106,
	"term": "garbage collection",
	"definition": "The automatic detection and freeing of memory that is no longer in use. The Java runtime system performs garbage collection so that programmers never explicitly free objects."
	},
{   "id": 107,
	"term": "generic",
	"definition": "A class, interface, or method that declares one or more type variables. These type variables are known as type parameters. A generic declaration defines a set of parameterized types, one for each possible invocation of the type parameter section. At runtime, all of these parameterized types share the same class, interface, or method."
	},
{   "id": 108,
	"term": "goto",
	"definition": "This is a reserved Java keyword. However, it is not used by current versions of the Java programming language."
	},
{   "id": 109,
	"term": "GUI",
	"definition": "Graphical User Interface. Refers to the techniques involved in using graphics, along with a keyboard and a mouse, to provide an easy-to-use interface to some program."
	},
{   "id": 110,
	"term": "hexadecimal",
	"definition": "The numbering system that uses 16 as its base. The marks 0-9 and a-f (or equivalently A-F) represent the digits 0 through 15. In programs written in the Java programming language, hexadecimal numbers must be preceded with 0x. See also octal ."
	},
{   "id": 111,
	"term": "hierarchy",
	"definition": "A classification of relationships in which each item except the top one (known as the root) is a specialized form of the item above it. Each item can have one or more items below it in the hierarchy. In the Java class hierarchy, the root is the Object class."
	},
{   "id": 112,
	"term": "HTML",
	"definition": "HyperText Markup Language. This is a file format, based on SGML, for hypertext documents on the Internet. It is very simple and allows for the embedding of images, sounds, video streams, form fields and simple text formatting. References to other objects are embedded using URLs."
	},
{   "id": 113,
	"term": "HTTP",
	"definition": "HyperText Transfer Protocol. The Internet protocol, based on TCP/IP, used to fetch hypertext objects from remote hosts. See also TCP/IP ."
	},
{   "id": 114,
	"term": "HTTPS",
	"definition": "HyperText Transfer Protocol layered over the SSL protocol."
	},
{   "id": 115,
	"term": "IDL",
	"definition": "Interface Definition Language. APIs written in the Java programming language that provide standards-based interoperability and connectivity with CORBA (Common Object Request Broker Architecture)."
	},
{   "id": 116,
	"term": "identifier",
	"definition": "The name of an item in a program written in the Java programming language."
	},
{   "id": 117,
	"term": "IIOP",
	"definition": "Internet Inter-ORB Protocol. A protocol used for communication between CORBA object request brokers."
	},
{   "id": 118,
	"term": "if",
	"definition": "A Java keyword used to conduct a conditional test and execute a block of statements if the test evaluates to true."
	},
{   "id": 119,
	"term": "impersonation",
	"definition": "An act whereby one entity assumes the identity and privileges of another entity without restrictions and without any indication visible to the recipients of the impersonator's calls that delegation has taken place. Impersonation is a case of simple delegation."
	},
{   "id": 120,
	"term": "implements",
	"definition": "A Java keyword included in the class declaration to specify any interfaces that are implemented by the current class."
	},
{   "id": 121,
	"term": "import",
	"definition": "A Java keyword used at the beginning of a source file that can specify classes or entire packages to be referred to later without including their package names in the reference."
	},
{   "id": 122,
	"term": "inheritance",
	"definition": "The concept of classes automatically containing the variables and methods defined in their supertypes . See also superclass , subclass ."
	},
{   "id": 123,
	"term": "instance",
	"definition": "An object of a particular class. In programs written in the Java programming language, an instance of a class is created using the new operator followed by the class name."
	},
{   "id": 124,
	"term": "instance method",
	"definition": "Any method that is invoked with respect to an instance of a class. Also called simply a method . See also class method ."
	},
{   "id": 125,
	"term": "instance variable",
	"definition": "Any item of data that is associated with a particular object. Each instance of a class has its own copy of the instance variables defined in the class. Also called a field . See also class variable ."
	},
{   "id": 126,
	"term": "instanceof",
	"definition": "A two-argument Java keyword that tests whether the runtime type of its first argument is assignment compatible with its second argument."
	},
{   "id": 127,
	"term": "int",
	"definition": "A Java keyword used to define a variable of type integer."
	},
{   "id": 128,
	"term": "interface",
	"definition": "A Java keyword used to define a collection of method definitions and constant values. It can later be implemented by classes that define this interface with the \"implements\" keyword."
	},
{   "id": 129,
	"term": "Internet",
	"definition": "An enormous network consisting of literally millions of hosts from many organizations and countries around the world. It is physically put together from many smaller networks and data travels by a common set of protocols."
	},
{   "id": 130,
	"term": "IP",
	"definition": "Internet Protocol. The basic protocol of the Internet. It enables the unreliable delivery of individual packets from one host to another. It makes no guarantees about whether or not the packet will be delivered, how long it will take, or if multiple packets will arrive in the order they were sent. Protocols built on top of this add the notions of connection and reliability. See also TCP/IP ."
	},
{   "id": 131,
	"term": "interpreter",
	"definition": "A module that alternately decodes and executes every statement in some body of code. The Java interpreter decodes and executes bytecode for the Java virtual machine 1 . See also compiler , runtime system ."
	},
{   "id": 132,
	"term": "JAR",
	"definition": "JAR (Java Archive) is a platform-independent file format that aggregates many files into one. Multiple applets written in the Java programming language, and their requisite components (.class files, images, sounds and other resource files) can be bundled in a JAR file and subsequently downloaded to a browser in a single HTTP transaction. It also supports file compression and digital signatures."
	},
{   "id": 133,
	"term": "Java",
	"definition": "Sun's trademark for a set of technologies for creating and safely running software programs in both stand-alone and networked environments."
	},
{   "id": 134,
	"term": "Java 2 Platform",
    "definition": "The second generation of the Java platform. (The first generation was the JDK.) Also see \"Java Platform\" and \"Java Platform Editions\"."
	},
{   "id": 135,
	"term": "Java 2 Platform, Enterprise Edition (J2EE platform)",
	"definition": "See Java 2 Platform, Enterprise Edition, under Java Platform Editions."
	},
{   "id": 136,
	"term": "Java 2 Platform, Micro Edition (J2ME platform)",
	"definition": "See Java 2 Platform, Micro Edition, under Java Platform Editions."
	},
{   "id": 137,
	"term": "Java 2 Platform, Standard Edition (J2SE platform)",
	"definition": "See Java 2 Platform, Standard Edition, under Java Platform Editions."
	},
{   "id": 138,
	"term": "Java 2 SDK, Standard Edition",
	"definition": "The Software Development Kit (SDK) is development environment for building applications, applets, and components using the Java programming language. This SDK provides a reference implementation of the J2SE platform."
	},
{   "id": 139,
	"term": "Java APIs for Integrated Networks (JAIN)",
	"definition": "enables the rapid development of Next Generation telecom products and services on the Java platform."
	},
{   "id": 140,
	"term": "Java Card API",
	"definition": "An ISO 7816-4 compliant application environment focused on smart cards."
	},
{   "id": 141,
	"term": "Java Compatibility Kit (JCK)",
	"definition": "A test suite, a set of tools, and other requirements used to certify a Java platform implementation conformant both to the applicable Java platform specifications and to Java Software reference implementations."
	},
{   "id": 142,
	"term": "Java Database Connectivity (JDBC)",
	"definition": "An industry standard for database-independent connectivity between the Java platform and a wide range of databases. The JDBC provides a call-level API for SQL-based database access."
	},
{   "id": 143,
	"term": "Java Development Kit (JDK)",
	"definition": "A software development environment for writing applets and applications in the Java programming language. Technically, the JDK is the correct name for all versions of the Java platform from 1.0 to 1.1.x."
	},
{   "id": 144,
	"term": "Java Foundation Classes (JFC)",
	"definition": "An extension that adds graphical user interface class libraries to the Abstract Windowing Toolkit (AWT)."
	},
{   "id": 145,
	"term": "Java Interface Definition Language (IDL)",
	"definition": "A set of Java APIs that provide CORBA (Common Object Request Broker Architecture) interoperability and connectivity capabilities for the J2EE platform. These capabilities enable J2EE applications to invoke operations on remote network services using the OMG IDL and IIOP."
	},
{   "id": 146,
	"term": "Java Media APIs",
	"definition": "A set of APIs that support the integration of audio and video clips, 2D fonts, graphics, and images as well as 3D models and telephony."
	},
{   "id": 147,
	"term": "Java Media Framework",
	"definition": "The core framework supports clocks for synchronizing between different media (e.g., audio and video output). The standard extension framework allows users to do full audio and video streaming."
	},
{   "id": 148,
	"term": "Java Naming and Directory Interface (JNDI)",
	"definition": "A set of APIs that assists with the interfacing to multiple naming and directory services."
	},
{   "id": 149,
	"term": "Java Native Interface",
	"definition": "A standard programming interface for writing Java native methods and embedding the JVM into native applications. The primary goal is binary compatibility of native method libraries across all JVM implementations on a given platform."
	},
{   "id": 150,
	"term": "Java Platform",
	"definition": "Consists of class libraries, a Java virtual machine (JVM) and class loader (which comprise the runtime environment) and a compiler, debugger and other tools (which comprise the development kit). In addition, the runtime platform is subject to a set of compatibility requirements to ensure consistent and compatible implementations. Implementations that meet the compatibility requirements may qualify for Sun's targeted compatibility brands."
	},
{   "id": 151,
	"term": "Java Platform Editions",
	"definition": "A Java platform \"edition\" is a definitive and agreed-upon version of the Java platform that provides the functionality needed over a broad market segment. An edition is comprised of two kinds of API sets: (i) \"core packages,\" which are essential to all implementations of a given platform edition, and (ii) \"optional packages,\" which are available for a given platform edition and which may be supported in a compatible implementation."
	},

{   "id": 152,
	"term": "Java 2 Platform, Enterprise Edition: ",
	"definition": "The edition of the Java platform that is targeted at enterprises to enable development, deployment, and management of multi-tier server-centric applications. "
	},
{   "id": 153,
	"term": "Java 2 Platform, Micro Edition: ",
	"definition": "The edition of the Java platform that is targeted at small, standalone or connectable consumer and embedded devices to enable development, deployment, and management of applications that can scale from smart cards through mobile devices and set-top boxes to conventional computing devices. "
	},
{   "id": 154,
	"term": "Java 2 Platform, Standard Edition: ",
	"definition": "The edition of the Java platform that enables development, deployment, and management of cross-platform, general-purpose applications."
	},
{   "id": 155,
	"term": "Java Remote Method Invocation (RMI)",
	"definition": "A distributed object model for Java program to Java program, in which the methods of remote objects written in the Java programming language can be invoked from other Java virtual machines 1 , possibly on different hosts."
	},
{   "id": 156,
	"term": "Java Runtime Environment (JRE)",
	"definition": "A subset of the Java Development Kit (JDK) for end-users and developers who want to redistribute the runtime environment alone. The Java runtime environment consists of the Java virtual machine 1 , the Java core classes, and supporting files."
	},
{   "id": 157,
	"term": "Java virtual machine 1",
	"definition": "A software \"execution engine\" that safely and compatibly executes the byte codes in Java class files on a microprocessor (whether in a computer or in another electronic device)."
	},
{   "id": 158,
	"term": "JavaBeans",
	"definition": "A portable, platform-independent reusable component model. A component that conforms to this model is called a bean."
	},
{   "id": 159,
	"term": "JavaCheck",
	"definition": "A tool for checking compliance of applications and applets to a specification."
	},
{   "id": 160,
	"term": "JavaSafe",
	"definition": "A tool for tracking and managing source file changes, written in Java."
	},
{   "id": 161,
	"term": "JavaScript",
	"definition": "A Web scripting language that is used in both browsers and Web servers. Like all scripting languages, it is used primarily to tie other components together or to accept user input."
	},
{   "id": 162,
	"term": "JavaSpaces",
	"definition": "A technology that provides distributed persistence and data exchange mechanisms for code in Java."
	},
{   "id": 163,
	"term": "JDBC",
	"definition": "See Java Database Connectivity."
	},
{   "id": 164,
	"term": "JDK",
	"definition": "Java Development Kit. A software development environment for writing applets and application in Java ."
	},
{   "id": 165,
	"term": "JFC",
	"definition": "Java Foundation Classes."
	},
{   "id": 166,
	"term": "Jini Technology",
	"definition": "A set of Java APIs that may be incorporated an optional package for any Java 2 Platform Edition. The Jini APIs enable transparent networking of devices and services and eliminates the need for system or network administration intervention by a user. The Jini technology is currently an optional package available on all Java platform editions."
	},

{   "id": 167,
	"term": "JNDI",
	"definition": "See Java Naming and Directory Interface."
	},
{   "id": 168,
	"term": "JNI",
	"definition": "See Java Native Interface."
	},
{   "id": 169,
	"term": "JRE",
	"definition": "See Java Runtime Environment"
	},
{   "id": 170,
	"term": "Just-in-time (JIT) Compiler",
	"definition": "A compiler that converts all of the bytecode into native machine code just as a Java program is run. This results in run-time speed improvements over code that is interpreted by a Java virtual machine."
	},
{   "id": 171,
	"term": "JVM",
	"definition": "See Java Virtual Machine (JVM)."
	},
{   "id": 172,
	"term": "keyword",
	"definition": "Java sets aside words as keywords - these words are reserved by the language itself and therefore are not available as names for variables or methods."
	},
{   "id": 173,
	"term": "lexical",
	"definition": "Pertaining to how the characters in source code are translated into tokens that the compiler can understand."
	},
{   "id": 174,
	"term": "linker",
	"definition": "A module that builds an executable, complete program from component machine code modules. The Java linker creates a runnable program from compiled classes. See also compiler , interpreter , runtime system ."
	},
{   "id": 175,
	"term": "literal",
	"definition": "The basic representation of any integer, floating point, or character value. For example, 3.0 is a double-precision floating point literal, and \"a\" is a character literal."
	},
{   "id": 176, 
	"term": "local variable",
	"definition": "A data item known within a block, but inaccessible to code outside the block. For example, any variable defined within a method is a local variable and can't be used outside the method."
	},
{   "id": 177,
	"term": "long",
	"definition": "A Java keyword used to define a variable of type long."
	},
{   "id": 178,
	"term": "member",
	"definition": "A field or method of a class. Unless specified otherwise, a member is not static."
	},
{   "id": 179,
	"term": "method",
	"definition": "A function defined in a class. See also instance method , class method . Unless specified otherwise, a method is not static."
	},
{   "id": 180,
	"term": "multithreaded",
	"definition": "Describes a program that is designed to have parts of its code execute concurrently. See also thread ."
	},
{   "id": 181,
	"term": "native",
	"definition": "A Java keyword that is used in method declarations to specify that the method is not implemented in the same Java source file, but rather in another language."
	},
{   "id": 182,
	"term": "new",
	"definition": "A Java keyword used to create an instance of a class."
	},
{   "id": 183, 
	"term": "null",
	"definition": "The null type has one value, the null reference, represented by the literal null, which is formed from ASCII characters. A null literal is always of the null type."
	},
{   "id": 184,
	"term": "object",
	"definition": "The principal building blocks of object-oriented programs. Each object is a programming unit consisting of data ( instance variables ) and functionality ( instance methods ). See also class ."
	},
{   "id": 185,
	"term": "object-oriented design",
	"definition": "A software design method that models the characteristics of abstract or real objects using classes and objects."
	},
{   "id": 186,
	"term": "octal",
	"definition": "The numbering system using 8 as its base, using the numerals 0-7 as its digits. In programs written in the Java programming language, octal numbers must be preceded with 0. See also hexadecimal ."
	},
{   "id": 187,
	"term": "optional packages",
	"definition": "The set or sets of APIs in a Java platform edition which are available with and may be supported in a compatible implementation. Over time, optional packages may become required in an edition as the marketplace requires them."
	},

{   "id": 188,
	"term": "ORB",
	"definition": "Object Request Broker. A library than enables CORBA objects to locate and communicate with one another."
	},
{   "id": 189,
	"term": "OS principal",
	"definition": "A principal native to the operating system on which the Java platform is executing."
	},
{   "id": 190,
	"term": "OTS",
	"definition": "Object Transaction Service. A definition of the interfaces that permit CORBA objects to participate in transactions."
	},
{   "id": 191,
	"term": "overloading",
	"definition": "Using one identifier to refer to multiple items in the same scope. In the Java programming language, you can overload methods but not variables or operators."
	},
{   "id": 192,
	"term": "overriding",
	"definition": "Providing a different implementation of a method in a subclass of the class that originally defined the method."
	},
{   "id": 193,
	"term": "package",
	"definition": "A group of types . Packages are declared with the package keyword."
	},
{   "id": 194,
	"term": "peer",
	"definition": "In networking, any functional unit in the same layer as another entity."
	},
{   "id": 195,
	"term": "persistence",
	"definition": "The protocol for transferring the state of a bean between its instance variables and an underlying database."
	},
{   "id": 196,
	"term": "pixel",
	"definition": "The picture element on a display area, such as a monitor screen or printed page. Each pixel is individually accessible."
	},
{   "id": 197,
	"term": "POA",
	"definition": "Portable Object Adapter. A CORBA standard for building server-side applications that are portable across heterogeneous ORBs."
	},
{   "id": 198,
	"term": "primary key",
	"definition": "An object that uniquely identifies an entity bean within a home."
	},
{   "id": 199,
	"term": "primitive type",
	"definition": "A variable data type in which the variable's value is of the appropriate size and format for its type: a number, a character, or a boolean value."
	},
{   "id": 200,
	"term": "principal",
	"definition": "The identity assigned to an entity as a result of authentication."
	},
{   "id": 201,
	"term": "private",
	"definition": "A Java keyword used in a method or variable declaration. It signifies that the method or variable can only be accessed by other elements of its class."
	},
{   "id": 202,
	"term": "privilege",
	"definition": "A security attribute that does not have the property of uniqueness and which may be shared by many principals. An example of a privilege is a group."
	},
{   "id": 203,
	"term": "process",
	"definition": "A virtual address space containing one or more threads."
	},
{   "id": 204,
	"term": "property",
	"definition": "Characteristics of an object that users can set, such as the color of a window."
	},
{   "id": 205,
	"term": "protected",
	"definition": "A Java keyword used in a method or variable declaration. It signifies that the method or variable can only be accessed by elements residing in its class, subclasses, or classes in the same package."
	},
{   "id": 206,
	"term": "public",
	"definition": "A Java keyword used in a method or variable declaration. It signifies that the method or variable can be accessed by elements residing in other classes."
	},
{   "id": 207,
	"term": "raster",
	"definition": "A two-dimensional rectangular grid of pixels."
	},
{   "id": 208,
	"term": "realm",
	"definition": "See security policy domain. Also, a string, passed as part of an HTTP request during basic authentication, that defines a protection space. The protected resources on a server can be partitioned into a set of protection spaces, each with its own authentication scheme and/or authorization database."
	},
{   "id": 209,
	"term": "reference",
	"definition": "A variable data type in which the variable's value is an address."
	},
{   "id": 210,
	"term": "return",
	"definition": "A Java keyword used to finish the execution of a method. It can be followed by a value required by the method definition."
	},
{   "id": 211,
	"term": "RMI",
	"definition": "See Java Remote Method Invocation ."
	},
{   "id": 212,
	"term": "roll\"definition\"",
	"definition": "The point in a transaction when all updates to any databases involved in the transaction are reversed."
	},
{   "id": 213,
	"term": "root",
	"definition": "In a hierarchy of items, the one item from which all other items are descended. The root item has nothing above it in the hierarchy. See also hierarchy , class , package ."
	},
{   "id": 214,
	"term": "RPC",
	"definition": "Remote Procedure Call. Executing what looks like a normal procedure call (or method invocation) by sending network packets to some remote host."
	},
{   "id": 215,
	"term": "runtime system",
	"definition": "The software environment in which programs compiled for the Java virtual machine 1 can run. The runtime system includes all the code necessary to load programs written in the Java programming language, dynamically link native methods, manage memory, handle exceptions, and an implementation of the Java virtual machine, which may be a Java interpreter."
	},
{   "id": 216,
	"term": "SAX",
	"definition": "Simple API for XML. An event-driven, serial-access mechanism for accessing XML documents."
	},
{   "id": 217,
	"term": "sandbox",
	"definition": "Comprises a number of cooperating system components, ranging from security managers that execute as part of the application, to security measures designed into the Java virtual machine 1 and the language itself. The sandbox protects sensitive system information from access by untrusted and potentially malicious applications."
	},
{   "id": 218, 
	"term": "scope",
	"definition": "A characteristic of an identifier that determines where the identifier can be used. Most identifiers in the Java programming environment have either class or local scope. Instance and class variables and methods have class scope; they can be used outside the class and its subclasses only by prefixing them with an instance of the class or (for class variables and methods) with the class name. All other variables are declared within methods and have local scope; they can be used only within the enclosing block."
	},
{   "id": 219,  
	"term": "Secure Socket Layer (SSL)",
	"definition": "A protocol that allows communication between a Web browser and a server to be encrypted for privacy."
	},
{   "id": 220, 
	"term": "security attributes",
	"definition": "A set of properties associated with a principal. Security attributes can be associated with a principal by an authentication protocol."
	},
{   "id": 221,
	"term": "security context",
	"definition": "An object that encapsulates the shared state information regarding security between two entities."
	},
{   "id": 222,
	"term": "serialization",
	"definition": "The encoding of objects, and the objects reachable from them, into a stream of bytes and the complementary reconstruction of the object graph from the stream."
	},
{   "id": 223,
	"term": "short",
	"definition": "A Java keyword used to define a variable of type short."
	},
{   "id": 224,
	"term": "single precision",
	"definition": "In the Java language specification, describes a floating point number with 32 bits of data. See also double precision ."
	},
{   "id": 225, 
	"term": "SGML",
	"definition": "Standardized Generalized Markup Language. An ISO/ANSI/ECMA standard that specifies a way to annotate text documents with information about types of sections of a document."
	},
{   "id": 226,
	"term": "SOAP",
	"definition": "The Simple Object Access Protocol (SOAP) uses a combination of XML-based data structuring and the Hyper Text Transfer Protocol (HTTP) to define a standardized method for invoking methods in objects distributed in diverse operating environments across the Internet."
	},
{   "id": 227, 
	"term": "SQL",
	"definition": "Structured Query Language. The standardized relational database language for defining database objects and manipulating data."
	},
{   "id": 228, 
	"term": "static",
	"definition": "A Java keyword used to define a variable as a class variable. Classes maintain one copy of class variables regardless of how many instances exist of that class. static can also be used to define a method as a class method. Class methods are invoked by the class instead of a specific instance, and can only operate on class variables."
	},
{   "id": 229, 
	"term": "static field",
	"definition": "Another name for class variable ."
	},
{   "id": 230, 
	"term": "static method",
	"definition": "Another name for class method ."
	},
{   "id": 231, 
	"term": "stream",
	"definition": "A stream is simply a byte-stream of data that is sent from a sender to a receiver. There are two basic categories, so the java.io package includes two abstract classes ( InputStream and OutputStream)."
	},
{   "id": 232, 
	"term": "subarray",
	"definition": "An array that is inside another array."
	},
{   "id": 233, 
	"term": "subclass",
	"definition": "A class that is derived from a particular class, perhaps with one or more classes in between. See also superclass , supertype ."
	},
{   "id": 234, 
	"term": "subtype",
	"definition": "If type X extends or implements type Y, then X is a subtype of Y. See also supertype ."
	},
{   "id": 235, 
	"term": "superclass",
	"definition": "A class from which a particular class is derived, perhaps with one or more classes in between. See also subclass , subtype ."
	},
{   "id": 236,
	"term": "super",
	"definition": "A Java keyword used to access members of a class inherited by the class in which it appears."
	},
{   "id": 237, 
	"term": "supertype",
	"definition": "The supertypes of a type are all the interfaces and classes that are extended or implemented by that type. See also subtype , superclass ."
	},
{   "id": 238, 
	"term": "switch",
	"definition": "A Java keyword used to evaluate a variable that can later be matched with a value specified by the case keyword in order to execute a group of statements."
	},
{   "id": 239, 
	"term": "Swing",
	"definition": "A collection of graphical user interface (GUI) components that runs uniformly on any native platform which supports the Java virtual machine *. Because they are written entirely in the Java programming language, these components may provide functionality above and beyond that provided by native-platform equivalents. (Contrast with AWT.)"
	},
{   "id": 240,
	"term": "synchronized",
	"definition": "A keyword in the Java programming language that, when applied to a method or code block, guarantees that at most one thread at a time executes that code."
	},
{   "id": 241, 
	"term": "TCP/IP",
	"definition": "Transmission Control Protocol based on IP. This is an Internet protocol that provides for the reliable delivery of streams of data from one host to another. See also IP ."
	},
{   "id": 242,
	"term": "Technology Compatibility Kit (TCK)",
	"definition": "A test suite, a set of tools, and other requirements used to certify an implementation of a particular Sun technology conformant both to the applicable specifications and to Sun or Sun-designated reference implementations."
	},
{   "id": 243,
	"term": "thin client",
	"definition": "A system that runs a very light operating system with no local system administration and executes applications delivered over the network."
	},
{   "id": 244,
	"term": "this",
	"definition": "A Java keyword that can be used to represent an instance of the class in which it appears. this can be used to access class variables and methods."
	},
{   "id": 245,
	"term": "thread",
	"definition": "The basic unit of program execution. A process can have several threads running concurrently, each performing a different job, such as waiting for events or performing a time-consuming job that the program doesn't need to complete before going on. When a thread has finished its job, the thread is suspended or destroyed. See also process ."
	},
{   "id": 246,
	"term": "throw",
	"definition": "A Java keyword that allows the user to throw an exception or any class that implements the \"throwable\" interface."
	},
{   "id": 247,
	"term": "throws",
	"definition": "A Java keyword used in method declarations that specify which exceptions are not handled within the method but rather passed to the next higher level of the program."
	},
{   "id": 248,
	"term": "transaction",
	"definition": "An atomic unit of work that modifies data. A transaction encloses one or more program statements, all of which either complete or roll \"definition\". Transactions enable multiple users to access the same data concurrently."
	},
{   "id": 249,
	"term": "transaction isolation level",
	"definition": "The degree to which the intermediate state of the data being modified by a transaction is visible to other concurrent transactions and data being modified by other transactions is visible to it."
	},
{   "id": 250,
	"term": "transaction manager",
	"definition": "Provides the services and management functions required to support transaction demarcation, transactional resource management, synchronization, and transaction context propagation."
	},
{   "id": 251, 
	"term": "transient",
	"definition": "A keyword in the Java programming language that indicates that a field is not part of the serialized form of an object. When an object is serialized, the values of its transient fields are not included in the serial representation, while the values of its non-transient fields are included."
	},
{   "id": 252,
	"term": "try",
	"definition": "A Java keyword that defines a block of statements that may throw a Java language exception. If an exception is thrown, an optional catch block can handle specific exceptions thrown within the try block. Also, an optional finally block will be executed regardless of whether an exception is thrown or not."
	},
{   "id": 253,
	"term": "type",
	"definition": "A class or interface."
	},
{   "id": 254,
	"term": "Unicode",
	"definition": "A 16-bit character set defined by ISO 10646. See also ASCII . All source code in the Java programming environment is written in Unicode."
	},
{   "id": 255,
	"term": "URI",
	"definition": "Uniform Resource Identifier. A compact string of characters for identifying an abstract or physical resource. A URI is either a URL or a URN. URLs and URNs are concrete entities that actually exist; A URI is an abstract superclass."
	},
{   "id": 256,
	"term": "URL",
	"definition": "Uniform Resource Locator. A standard for writing a text reference to an arbitrary piece of data in the WWW. A URL looks like \"protocol://host/localinfo\" where protocol specifies a protocol to use to fetch the object (like HTTP or FTP), host specifies the Internet name of the host on which to find it, and localinfo is a string (often a file name) passed to the protocol handler on the remote host."
	},
{   "id": 257,
	"term": "URN",
	"definition": "Uniform Resource Name. A unique identifier that identifies an entity, but doesn't tell where it is located. A system can use a URN to look up an entity locally before trying to find it on the Web. It also allows the Web location to change, while still allowing the entity to be found."
	},
{   "id": 258,
	"term": "variable",
	"definition": "An item of data named by an identifier. Each variable has a type, such as int or Object, and a scope. See also class variable , instance variable , local variable ."
	},
{   "id": 259,
	"term": "virtual machine",
	"definition": "An abstract specification for a computing device that can be implemented in different ways, in software or hardware. You compile to the instruction set of a virtual machine much like you'd compile to the instruction set of a microprocessor. The Java virtual machine consists of a bytecode instruction set, a set of registers, a stack, a garbage-collected heap, and an area for storing methods."
	},
{   "id": 260,
	"term": "void",
	"definition": "A Java keyword used in method declarations to specify that the method does not return any value. void can also be used as a nonfunctional statement."
	},
{   "id": 261,
	"term": "volatile",
	"definition": "A Java keyword used in variable declarations that specifies that the variable is modified asynchronously by concurrently running threads."
	},
{   "id": 262,
	"term": "Web server",
	"definition": "Software that provides services to access the Internet, an intranet, or an extranet. A Web server hosts Web sites, provides support for HTTP and other protocols, and executes server-side programs (such as CGI scripts or servlets) that perform certain functions."
	},
{   "id": 263,
	"term": "while",
	"definition": "A Java keyword used to declare a loop that iterates a block of statements. The loop's exit condition is specified as part of the while statement."
	},
{   "id": 264,
	"term": "world readable files",
	"definition": "Files on a file system that can be viewed (read) by any user. For example: files residing on Web servers can only be viewed by Internet users if their permissions have been set to world readable."
	},
{   "id": 265,
	"term": "wrapper",
	"definition": "An object that encapsulates and delegates to another object to alter its interface or behavior in some way."
	},
{   "id": 266,
	"term": "WWW",
	"definition": "World Wide Web. The web of systems and the data in them that is the Internet. See also Internet . "
	},
{   "id": 267,
	"term": "XML",
	"definition": "Extensible Markup Language. A markup language that allows you to define the tags (markup) needed to identify the data and text in XML documents. "
    }
    ]
}
